{
  "url": "https://www.benzinga.com/government/24/01/36464905/why-are-nvidia-and-amd-stock-trading-lower-wednesday",
  "scrapingTimestamp": "2025-06-01T09:07:01.972948",
  "parsingTimestamp": "2025-06-16T18:30:43.826222Z",
  "articleText": "Nvidia CorpNVDA-3.36%Get Free ReportandAdvanced Micro Devices, IncAMD-2.37%Get Free Reportare facing repercussions from the Netherlands' move to restrict the export of specificlithography systems to China. The Dutch government's action targets the NXT:2050i and NXT:2100i systems, which are crucial in producing advanced microprocessors. Nvidia commands a 90% share in China's AI chip market, valued at $7 billion. As the new year unfolds, Nvidia and other tech giants are part of a more optimistic Wall Street outlook. Contrary to last year's skepticism, stocks rose significantly in 2023, driven by the emergence of artificial intelligence and a more resilient economy than expected, avoiding the anticipated recession. The S&P 500 is now very close to a record high, reflecting a dramatic shift in investor sentiment, the Wall Street Journalreports. Investors are increasingly convinced that the Federal Reserve's inflation-fighting measures are nearing an end, likely shifting from rate hikes to cuts. This policy change alters market dynamics, offering a more favorable outlook than previous expectations. However, potential risks like economic shocks or political uncertainties could lead to market volatility. The year 2023 ended with a broad-based rally across various asset classes, lifting stocks, bonds, gold, and even cryptocurrencies. The S&P 500 saw a return of 24%, and Wall Street's fear index, the Cboe Volatility Index, indicated low market stress levels. Fund managers surveyed in December expressed a high level of optimism, the most since early 2022. A significant majority anticipate the Fed will stop raising interest rates, with many expecting lower bond yields within a year. Corporate bonds, in particular, are seen as an attractive investment opportunity. Wall Street forecasts robust corporate earnings growth, projecting an 11.6% increase for S&P 500 companies in the new year. However, there's skepticism about the future performance of major tech companies, known as the \"Magnificent Seven,\" which includes Nvidia,Apple IncAAPL+0.17%Get Free Report,Alphabet IncGOOG-0.38%Get Free ReportGOOGL-0.39%Get Free Report,Amazon.Com IncAMZN-0.54%Get Free Report,Meta Platforms IncMETA+0.26%Get Free Report,Microsoft CorpMSFT+0.22%Get Free Report, andTesla IncTSLA-3.60%Get Free Report. These companies dominated the market in 2023, but their future potential remains debatable among investors. Overall, the market outlook for 2024 is cautiously optimistic, with expectations of interest rate cuts and opportunities in various sectors despite potential risks from the presidential election and policy shifts. DA Davidsonanalyst Gil Luria initiated coverage on Nvidia with a Neutral rating and aprice target of $410. Price Actions:NVDA shares traded lower by 0.02 % at $481.10 on the last check Wednesday. AMD shares traded lower by 1.73% at $136.18. Disclaimer:This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors. Photo via Wikimedia Commons Benzinga Rankings give you vital metrics on any stock – anytime. © 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
}