{
  "url": "https://www.benzinga.com/24/12/42645821/elon-musks-xai-expands-with-new-chatbot-app",
  "scrapingTimestamp": "2025-06-03T07:01:12.608599",
  "parsingTimestamp": "2025-06-16T18:30:43.876188Z",
  "articleText": "Elon Musk’s artificial intelligence company,xAI, is testing a standaloneApple IncAAPL+0.41%Get Free ReportiOS app for its chatbot, Grok. Grok was now available only to users of Musk-ownedX(formerlyTwitter Inc). The app can access real-time data from the web and X and offers generative AI features like rewriting text and generating imagesfrom text prompts. Also Read:Broadcom Expects Decade-Long AI Chip Boom as Big Tech Invest Billions xAI is also preparing a site, Grok.com, to make the chatbot accessible on the web, TechCrunchreports. Grok was previously available only to X’s paying subscribers. In November, the company started testing a free chatbot version and rolled it out to all users earlier this month. The company’s chatbot image generator model allows users to create images using pictures of public figures and copyrighted material. xAI has reportedly reached a$50 billion valuationjust 16 months after its July 2023 founding, surpassing the billionaire’s spending on acquiring Twitter. OpenAI, one of the most recognized names in artificial intelligence, took over nine years to reach its current valuation of $157 billion. Reportedly, xAI is rapidly gaining momentum in the competitive AI market, now valued higher than rivals like Anthropic, worth $19 billion, and Perplexity, valued at $2.8 billion. xAI achieved significant milestones by securing $5 billion in its latest funding round to acquire 100,000 Nvidia chips. These chips will drive the Memphis supercomputer, a facility built to advance the company’s AI capabilities and bolster Tesla’s Full Self-Driving (FSD) technology. Also Read: Wall Street Analysts Are Bullish On Salesforce’s AI Vision – Here’s Why Photo courtesy: Shutterstock Benzinga Rankings give you vital metrics on any stock – anytime. © 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
}