{
  "url": "https://www.benzinga.com/general/24/01/36444463/buffetts-bullseye-meet-the-4-stocks-that-make-up-nearly-75-of-his-portfolio",
  "scrapingTimestamp": "2025-06-01T08:54:38.279299",
  "parsingTimestamp": "2025-06-16T18:30:43.779028Z",
  "articleText": "Legendary investor Warren Buffett has long preached the importance of passive investing in large-cap stocks. \"Beware the investment activity that produces applause; the great moves are usually greeted by yawns,\" said Buffett, who also is a big fan of dividend-yielding stocks, which he calls the secret sauce to Berkshire Hathaway Inc.'s success. Nearly 75% of Buffett's portfolio is invested in just five stocks. Take a closer look. Mode Mobiledeveloped a smartphone called EarnPhone, which allows users to earn and save money by playing video games, listening to music and reading the news. With the phone priced at an affordable $99, the barriers to adoption are low.Earning Opportunity for All Smartphone UsersMode EarnPhoneState-of-the-art smartphone device includes built-in earning features.EarnOSProprietary earning software turns smartphones into EarnPhones. Apple Buffett has been a long-time supporter ofApple Inc.AAPL+0.17%Get Free Report, which he calls a \"better business than any we own.\" Approximately 50.04% of his portfolio is invested in Apple, which was valued at over $155 billion as of Sept. 30. Despite uncertainty in the market, demand for Apple's products remains strong, with iPhone sales hitting a record high in the fiscal fourth quarter that ended Sept. 30. Apple shares have risen 49% year-to-date, making it one of the best-performing tech stocks this year. “We now have our strongest lineup of products ever heading into the holiday season, including the iPhone 15 lineup and our first carbon-neutral Apple Watch models, a major milestone in our efforts to make all Apple products carbon neutral by 2030,” Apple CEO Tim Cook said. Wedbush has an Overweight rating on Apple stock with a price target of $250, indicating a potential upside of nearly 30%. Morgan Stanley also has an Overweight rating on the tech behemoth with a price target of $220, indicating a potential upside of over 13%. Don’t Miss: Investing in real estate just got a whole lot simpler.This Jeff Bezos-backed startupwill allow you to become a landlord in just 10 minutes, and you only need $100. Warren Buffett once said, \"If you don’t find a way to make money while you sleep, you will work until you die.\"Here are three high-yield investments to add significant income to your portfolio. Coca-Cola Buffett generated nearly $704 million in dividends from his investment in theCoca-Cola Co.KO+0.78%Get Free Report. His initial investment of $1.3 billion in Coca-Cola stock has multiplied to $25 billion, according to Berkshire Hathaway's 2022 annual shareholder letter. Buffett owns 400 million shares of Coca-Cola through Berkshire Hathaway, which accounts for 7.15% of his total portfolio. Coca-Cola currently pays $1.84 in dividends annually, yielding nearly 3.2% on the current stock price. The Dividend Aristocrat stock has a dividend payout history, as it has hiked its annual dividend payouts for 61 consecutive years. Despite the volatile market backdrop, Coca-Cola is expected to maintain stable growth momentum, as the company's revenue is expected to rise by 4.1% in the quarter ending December. The consensus earnings per share (EPS) estimate of $0.48 for the quarter ending in December indicates a 6.7% year-over-year increase. Bank of America Berkshire Hathaway owns approximately 1.03 billion shares ofBank of America Corp.BAC-0.66%+ Free Alerts, accounting for over 9% of Buffett's investment portfolio. Shares of Bank of America rose by over 20% in the past three months. Bank of America has benefitted from the decades-high interest rates, as the bank's total net income rose by 10% year over year to $7.8 billion in the fiscal third quarter that ended Sept. 30. Its EPS for the quarter amounted to $0.90, indicating an 11% rise from the same period last year. Bank of America also raised its dividend payouts by 9% back in July, bringing its total annual dividends to $0.96 and yielding 2.89% on the current price. Odeon Capital Group upgraded its outlook on Bank of America stock from Hold to Buy on Dec. 13 with a price target of $37.94, indicating an over 13% potential upside. American Express American Express Co.AXP-0.45%+ Free Alertsis Buffett's third-largest holding, accounting for 7.22% of Berkshire Hathaway's stock holdings. With U.S. credit card debt topping $1 trillion in the second quarter, American Express reported an improvement in its financials. Spending by millennial and Gen Z American Express customers rose by 18% year over year in the fiscal third quarter, which ended Sept. 30. American Express reported record third-quarter revenue for the sixth consecutive quarter, up 13% from the same period last year. American Express's EPS increased by 34% year over year to $3.30 for the third quarter. The consensus revenue estimate of $16.01 billion for the quarter ending in December indicates a 13% year-over-year increase. Wall Street expects the American Express EPS to amount to $2.65 for the quarter, indicating a 13% year-over-year increase. Read Next: Elon Musk may be adding landlord to his list of titles.Here’s how to join him in his latest venture with as little as $100. Collecting passive income from real estate just got a whole lot simpler. A newreal estate fund backed by Jeff Bezosgives you instant access to a diversified portfolio of rental properties, and you only need $100 to get started. Benzinga Rankings give you vital metrics on any stock – anytime. © 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
}